# FROM : 시작할 이미지파일을 지정한다. 일반적으로는 OS 이미지를 지정
# 로컬에 해당 파일이 있다면 그 파일을 사용하고 없다면 Docker hub에서 이미지를 가져온다.
FROM node:20-slim

# WORKDIR : cd 명령어와 비슷하다. 해당 경로로 이동하는 명령어.
WORKDIR /app

# COPY A B : A경로에 있는 파일을 이미지파일 내의 B경로로 복사한다. 현재 경로는 app이므로 app폴더내에 복사가 된다.
# 라이브러리 내용은 자주 변하지 않으므로 package 관련 파일을 먼저 복사한다. (캐싱)
COPY package*.json .

# RUN : 명령어를 실행한다.
# package.json을 통해 설치한다.
# RUN npm install 처럼 대괄호 없이 사용도 가능하지만 shell을 사용하게되어 호환성 문제가 생길 수 있다.
# RUN ["npm", "install"] 을 사용하면 의존성을 얕게 고려한다. 버전범위가 존재할경우 최신버전을 다운로드 하는 등의 문제가 발생한다.
# 명시된 라이브러리 버전을 있는 그대로 설치하려면 ci(clean install)를 사용하는것이 안정적이다.
RUN ["npm", "ci"]

# ENV : 환경변수를 설정한다. 
# 오래된 라이브러리(express도 해당됨)의 경우 production 환경에서 더욱 좋은 성능을 내도록 설계되어있다. production 환경변수는 기본적으로 추가해주는것이 좋다.
ENV NODE_ENV=production

# package 관련 파일을 먼저 복사하여 npm install을 수행하면 해당 내용이 캐싱되어 라이브러리 내역이 변하지 않으면 좀더 빠른 빌드가 가능하다.
# 패키지 설치가 끝난뒤 소스코드를 복사하는 명령어
# dockerignore 파일로 복사하지 않을 파일을 지정할 수 있다.
COPY . .

# EXPOSE : 이 가상 컴퓨터에서 열어둘 포트 번호를 지정한다.
EXPOSE 8080

# USER : 사용자를 변경한다.
# docker는 기본적으로 root 권한으로 실행되는데 서버를 실행하는 등의 동작에서는 권한을 일반권한으로 낮추는것이 안전한경우도 있다.
# 시작이미지파일인 node는 node라는 사용자를 기본적으로 제공하므로 빠르게 사용할 수 있다. 기본 OS 이미지파일을 사용한다면 사용자를 직접 만들어 사용하면 된다.
USER node

# 마지막 명령어는 CMD를 사용한다. (국룰임) CMD에 있는 내용은 도커 이미지 실행시 커스텀이 가능하다.
# 마지막 명령어에는 ENTRYPOINT도 사용할 수 있다. CMD와는 다르게 수정이 어려워서 안정적인 편이다.
CMD ["node", "server.js"]